In [1]:
import pandas as pd
import numpy as np

In [11]:
test_df = pd.read_csv('test2.csv', sep= ';')

In [12]:
test_df.head()

      Unnamed: 0  column1  column2  column3  column4
Row1           0        1        2        3        4
Row2           5        6        7        8        9
Row3          10       11       12       13       14
Row4          15       16       17       18       19

In [3]:
df = pd.read_csv('mercedesbenz.csv')

In [4]:
df.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [7]:
df.describe() ## this wil skip the categorial features values as we can't find the min, mean and standard deviation for those

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

## CSV

In [13]:
from io import StringIO, BytesIO

In [29]:
data=('Ã§ol1, col2, col3\n'
'x, y,1\n'
     'a, b, 2\n'
     'c,d,3')

In [15]:
type(data)

str

In [30]:
pd.read_csv(StringIO(data))

  Ã§ol1  col2   col3
0    x     y      1
1    a     b      2
2    c     d      3

In [32]:
# read data from specific columns
df_csv = pd.read_csv(StringIO(data))

In [33]:
df_csv.head()

  Ã§ol1  col2   col3
0    x     y      1
1    a     b      2
2    c     d      3

In [35]:
df_csv.to_csv('testabc.csv') #  dump the data to csv file

In [36]:
data=('a, b, c, d\n'
'1, 2,3,4\n'
     '5, 6, 7,8\n'
     '9,10,11,12')

In [37]:
print(data)

a, b, c, d
1, 2,3,4
5, 6, 7,8
9,10,11,12

In [49]:
df=pd.read_csv(StringIO(data), dtype=float) # setting the built in data type for the columns, object type the values will be strings

In [50]:
df

     a     b     c     d
0  1.0   2.0   3.0   4.0
1  5.0   6.0   7.0   8.0
2  9.0  10.0  11.0  12.0

In [41]:
df['a']

0    1
1    5
2    9
Name: a, dtype: object

In [42]:
df['a'][1]

'5'

In [43]:
type(df['a'][1])

str

In [44]:
df['a']

0    1
1    5
2    9
Name: a, dtype: object

In [64]:
df1=pd.read_csv(StringIO(data), dtype={'a': int, 'b':int, 'c':float, 'd':'object'})

In [65]:
df1

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [66]:
df1.dtypes

a     int32
 b    int64
 c    int64
 d    int64
dtype: object

In [69]:
data = ('a, b, c\n'
           '4, apple, bat\n'
           '8, orange, cow')

In [70]:
pd.read_csv(StringIO(data))

   a        b     c
0  4    apple   bat
1  8   orange   cow

In [76]:
pd.read_csv(StringIO(data))

   a        b     c
0  4    apple   bat
1  8   orange   cow

In [77]:
## Quoting and Escape charaters, very useful in NLP
data = 'a,b \n"hello,  \\"Bob\\", nice to see you", 5'

In [78]:
pd.read_csv(StringIO(data), escapechar='\\')

                                a  b
0  hello,  "Bob", nice to see you   5